package main;

public class Miniproj1 {

	public static void main(String[] args) {
		
		//첫 화면 출력 (함수로 만들 것)
		
		
		
		
		
		
		//1. 회원 가입 선택 시
			//회원 가입 화면 출력(함수로 만들 것)
		
			// 1. 가입 선택 시
				// 가입 축하 출력 후 첫 화면 출력
		
			// 2. 다시 입력 선택 시
				// 회원 가입 화면 출력
			// 3. 이전 화면 선택 시
				//첫 화면 출력
		
		
		//2. 로그인 선택 시
			//로그인 화면 출력 (함수로 만들 것)
				//1. 로그인 선택 시
				// 아이디/비번 검증
					//성공 시 로그인 성공 화면 출력(함수로 만들 것)
					//실패 시 오류 메세지 출력
				//2. 다시 입력 선택 시
					//로그인 화면 출력
				//3. 이전 화면으로 선택 시
					//첫 화면 출력
		
		//3. 아이디 찾기 선택 시
			// 전화번호와 이메일 검증
				// 성공 시 아이디 출력
				//실패 시 오류 메시지 출력
			
		
		//4. 비밀번호 초기화 선택 시
			//아이디 검증
				//성공 시 비밀번호 다시 입력
				//실패 시 오류 메시지 출력
		
		//5. 종료 선택 시
		//프로그램 종료
		
		
		
		
		
		
		//로그인 성공 시
		
			//1. 나의 정보 확인
				//정보 수정 시 비밀 번호 검증 필요
			//2. 게시물 목록
			//3. 회원 목록
				// 해당 아이디의 role 확인해서 관리자 일 경우에만 출력
			//4. 로그아웃
				//첫 화면 출력
			//5.종료
				//프로그램 종료
		
		
	}

}
